# -*- coding: utf-8 -*-
"""
네이버 전체 서비스에 대한 공통 라이브러리를 제공한다.

- MongoDB를 사용하지 않는다.
- 스크랩 모듈 제공.
- 상수값 제공.
"""
# print(f"{'@'*50} {__name__}")
# ============================================================ Python.
import os
# ============================================================ External-Library.
# ============================================================ My-Library.
# ============================================================ Project.
# ============================================================ Constant.
PJT_NAME = os.path.basename(os.path.dirname(__file__))
